ЕСКД/src/Catalogs/mega_Спецификации/mega_Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Спецификации</name>
  <basedOn>Catalog.mega_ШаблоныСпецификаций</basedOn>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииОбработки</name>
    <attributes>
      <name>ВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_Спецификации/ManagerModule.bsl
Функция ПолучитьПервуюНеПомеченнуюНаУдалениеСпецификацию(Номенклатура)Экспорт 
	Спецификация = Справочники.mega_Спецификации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	mega_Спецификации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.mega_Спецификации КАК mega_Спецификации
	|ГДЕ
	|	mega_Спецификации.Владелец = &Номенклатура
	|	И НЕ mega_Спецификации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	Если Выборка.Следующий() Тогда 
		
		Спецификация = Выборка.Ссылка;		
	КонецЕсли;                                
	
	Возврат Спецификация;
КонецФункции

Функция ПолучитьОсновнуюСпецификациюНоменклатуры(Номенклатура)Экспорт 
	
	ОсновнаяСпецификация = Номенклатура.Спецификация;
	Если ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда 
		
		Возврат ОсновнаяСпецификация;
	КонецЕсли;
	
	Возврат ПолучитьПервуюНеПомеченнуюНаУдалениеСпецификацию(Номенклатура);
КонецФункции

Функция ПолучитьСтруктуруВозвратаСтадииОбработки()
	
	Структура = Новый Структура;
	Структура.Вставить("НомерСтроки", 0);
	Структура.Вставить("ВидСтадииОбработки", Справочники.mega_ВидыСтадийОбработки.ПустаяСсылка());
	Структура.Вставить("КлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Возврат Структура;
КонецФункции

Функция ПолучитьПервуюСтадиюОбработки(Спецификация)Экспорт	
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;	
	
	ПерваяСтрока = Спецификация.СтадииОбработки[0];
	ЗаполнитьЗначенияСвойств(Структура, ПерваяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьПоследнююСтадиюОбработки(Спецификация)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;	
	
	ПоследняяСтрока = Спецификация.СтадииОбработки[Спецификация.СтадииОбработки.Количество() - 1];
	ЗаполнитьЗначенияСвойств(Структура, ПоследняяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьСтадиюОбработкиПоВидуСтадииОбработки(Спецификация, ВидСтадииОбработки)Экспорт
	
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Строки = Спецификация.СтадииОбработки.НайтиСтроки(Новый Структура("ВидСтадииОбработки", ВидСтадииОбработки));
	Если Строки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	НайденнаяСтрока = Строки[0];
	ЗаполнитьЗначенияСвойств(Структура, НайденнаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьПредыдущуюСтадиюОбработки(Спецификация, ТекущаяСтадияОбработки)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Если ТекущаяСтадияОбработки.НомерСтроки <= 1 Тогда 
		
		Возврат Структура;
	КонецЕсли;
		
	ПредыдущаяСтрока = Спецификация.СтадииОбработки[(ТекущаяСтадияОбработки.НомерСтроки - 1) - 1];
	ЗаполнитьЗначенияСвойств(Структура, ПредыдущаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьСледующуюСтадиюОбработки(Спецификация, ТекущаяСтадияОбработки)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Если ТекущаяСтадияОбработки.НомерСтроки = Спецификация.СтадииОбработки.Количество() ИЛИ 
		ТекущаяСтадияОбработки.НомерСтроки = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
		
	СледующаяСтрока = Спецификация.СтадииОбработки[ТекущаяСтадияОбработки.НомерСтроки];
	ЗаполнитьЗначенияСвойств(Структура, СледующаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьВремяПроизводстваЕдиницыСпецификации(Спецификация, Количество = 1)Экспорт
	Время = 0;
	
	Для Каждого ТекСтрокаТехнологическиеОперации Из Спецификация.ТехнологическиеОперации Цикл 
		
		Время = Время + (ТекСтрокаТехнологическиеОперации.ВремяВыполнения / Спецификация.Количество * Количество);
	КонецЦикла;
	
	Возврат Время;
КонецФункции
